Table of Contents
 Enum WeldType
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
enum of weld types
public enum WeldType
Fields
Bevel = 4
Bevel
Contact = 128
Contact
DoubleFillet = 2
DoubleFillet
Fillet = 1
Fillet
FilletRear = 64
FilletRear
Intermittent = 256
Intermittent
LengthAtHaunch = 32
LengthAtHaunch
NotSpecified = 0
NotSpecified
Plug = 16
Plug
Square = 8
Square
Fields
 Name |  Description
 Bevel = 4
Bevel
 Contact = 128
Contact
 DoubleFillet = 2
DoubleFillet
 Fillet = 1
Fillet
 FilletRear = 64
FilletRear
 Intermittent = 256
Intermittent
 LengthAtHaunch = 32
LengthAtHaunch
 NotSpecified = 0
NotSpecified
 Plug = 16
Plug
 Square = 8
Square
 Edit this page